package com.codelab.newsapp;

import com.google.gson.annotations.SerializedName;

import java.util.List;

/**
 * Created by SniperDW on 12/20/2016.
 */

public class Response {

    /**
     * respond : 1
     * paging : {"stillmore":1,"perpage":"5","callpage":"1","next":2,"previous":0,"pages":3,"result":"11"}
     * message :
     * result : [{"ID":"22","post_title":"الويب الخفي - الديب ويب","guid":"http://codelab.d3stud.io/?p=22","post_content":"الويب الخفي \u2013 الديب ويب: ربما تظن أنك تعرف الانترنت جيدًا، لكن مواقع مثل فيسبوك، أمازون، وانستاجرام، هي مجرد السطح الخارجي. هناك عالم آخر بكامله تحت هذا السطح: الشبكة العميقة.\r\nهذه الأعماق هي المكان الذي يكون فيه تداول المعلومات مؤمنًا بكلمة سر، محميًا خلف أسوار المناطق غير المجانية، أو يحتاج إلى برمجيات خاصة للوصول إليه، وهو مكان في غاية الضخامة. يقدر البعض هذا الجزء بأنه يبلغ 500 ضعفًا من حجم الشبكة المنظورة التي يتصفحها الناس يوميًا. بالرغم من ذلك فهذا الجزء شبه غائب تمامًا عن النظر. فبحسب دراسة نشرت في نشرة \u201cالطبيعة\u201d Nature يقوم جوجل بتبويب ما لايزيد عن 16% من سطح الشبكة، و يغفل تمامُا كل الشبكة العميقة. أي محاولة بحث لا ينتج عنها إلا 0.03% من المعلومات الموجودة على الانترنت (صفحة من كل 3000 صفحة). يشبه الأمر القيام بالصيد في جزء يقل عمقه عن المتر في المحيط كله، هنا أنت تغفل \u201cماريانا ترينش\u201d[1] التخيلي الكامن أسفل السطح.\r\nمعظم مناطق الشبكة العميقة الغير مبوبة تقع في قواعد البيانات اليومية البسيطة، مثل ليكسيز-نيكسيز[2] أو سجلات مكتب براءات الاختراع بالولايات المتحدة. لكن على غرار دمية ماتريوشكا الروسية، تحتوي الشبكة العميقة على عالم أشد عمقًا، مجتمع أصغر لكنه شديد الأهمية، حيث يجتمع الأشرار لتحقيق أغراض دنيئة. مرحبًا بك في الشبكة المظلمة، والتي تسمى أحيانًا دارك-نت Darknet، وهو قبو رقمي ضخم يجتمع فيه الهاكرز ورجال العصابات والإرهابيون والبيدوفايلز[3] ليمارسوا تجاراتهم. في السطور التالية سنعرض لك ما لا يزيد عن عينة سريعة من البضائع والخدمات التي يتم تداولها في أعمق كهوف الشبكة وأشدها ظلمة.\r\nالأشياء التي يمكنك شراءها:\r\n1- المخدرات\r\nكميات فردية أو تجارية من المخدرات القانونية و الغير قانونية من كل الأنواع متاحة للبيع في القبو الرقمي. متجر الطريق الحريري Silk Road الألكتروني، أكبر متجر للمخدرات والذي تم إغلاقه الآن، بلغ حجم أعماله 200 مليون دولار في خلال 28 شهرًا.\r\n2- العملة المقلدة\r\nالنقود المزورة تتباين فيما بينها كثيرًا من حيث الجودة والتكلفة، لكن اليورو، والجنيه الاسترليني، والين، كلهم متاحون للبيع. ستمائة دولار قد توفر لك شراء 2500 دولار من العملة الأميريكية المقلدة، مع وعد بقدرة العملة المقلدة على تخطي قلم الفحص والأشعة فوق البنفسجية.\r\n3- المستندات المزورة\r\nجواز السفر، رخصة القيادة، أوراق الجنسية، إثباتات الشخصية المزورة، الشهادات الجامعية، أوراق الهجرة، بل وبطاقات إثبات الشخصية الديبلوماسية، كلها متاحة في السوق غير القانوني (مثل أونيون لخدمات الهوية). رخصة قيادة أميريكية تكلفك تقريبًا 200 دولارا أميريكيًا، بينما جواز السفر الأميريكي أو الإنجليزي سيكلفك بضعة آلاف من الدولارات.\r\n4- الأسلحة الشخصية، الذخيرة، المتفجرات\r\nالأسلحة، مثل الطبنجة الشخصية، ومتفجرات C4 يمكن شراءها من الشبكة المظلمة. يشحن الباعة بضاعتهم في مغلفات خاصة لتجنب أشعة إكس، أو يبعثون بأجزاء السلاح مخبأة داخل ألعاب، أو آلات موسيقية أو أجهزة إلكترونية.\r\n5- القتلة المأجورون\r\nمقدمي الخدمة \u2013 ومن بينهم شركة تسمى كولولهولو C\u2019thulhu على اسم الوحش الذي ابتكره الكاتب ه. ب. لوفكرافت H.P. Lovecraft في رواياته \u2013 يقدمون دعاياتهم بعبارة \u201cحلول دائمة لمشكلات شائعة\u201d. هؤلاء القتلة المأجورون يقومون بكل شيء، بداية من الضغائن الشخصية حتى الاغتيالات السياسية، ويقبلون مقابل أعمالهم الدفع عن طريق البيتكوين (bitcoin) كأجرة، ويقدمون دليلا مصورًا على إتمام المهمة.\r\n6- الأعضاء البشرية\r\nفي الأركان الأشد ظلمة من الشبكة، تنتعش سوق سوداء ضخمة للأعضاء البشرية. الكلى قد تباع لقاء 200 ألف دولار، القلوب مقابل 120 ألف دولار، و الكبد مقابل 150 ألف دولار. زوج من الأعين يكلف 1500 دولارا.\r\nالأشياء التي تجعل جرائم الانترنت ناجحة\r\n1- النقود المشفرة\r\nالنقود الرقمية (مثل بيتكوين ودارك-كوين)، ونظام دفع ليبرتي ريسيرف (Liberty Reserve) يقدمان نظامًا ملائمًا للمستخدمين لإنفاق الأموال أونلاين مع اخفاء هوياتهم الحقيقية.\r\n2- خدمة خالية من الثغرات لاستضافة المواقع\r\nبعض مضيفي المواقع في روسيا وأوكرانيا يرحبون بأي محتوى، لا يحاولون بأي شكل معرفة هوية زبائنهم الحقيقية، و يقبلون الدفع مجهول الهوية بواسطة بيتكوين، و يتجاهلون باستمرار مذكرات الضبط والإحضار من السلطات.\r\n3- الحوسبة السحابية Cloud Computing:\r\nعن طريق وضع برامجهم المؤذية Malware في ضيافة الشركات ذات السمعة النظيفة، لا يعاني الهاكرز من أي اعتراض لتداولاتهم من جانب الأنظمة الأمنية. أشارت دراسة حديثة أن 16% من البرمجيات المؤذية في العالم وقنوات توزع الهجمات الألكترونية بدأت من سحابة أمازون.\r\n4- برمجيات الجريمة\r\nالمجرمين الأقل مهارة بإمكانهم شراء كل الأدوات التي يحتاجونها للعثور على ثغرات النظام، و سرقة الهويات، و تهديد السيرفرات، و سرقة المعلومات. في عام 2013 لم يتطلب الأمر أكثر من هاكر يملك مجموعة أدوات مشابهة لغزو نظام نقاط بيع تارجت Target\u2019s point-of-sale system .\r\n5- هاكرز للإيجار\r\nنقابات الجريمة الألكترونية المنظمة تعرض الهاكرز للإيجار. مجموعة لينكس الصينية السرية تفخر بتوفر مايقرب من 100 لص ألكتروني محترف، بعضهم يعرف عنه أنه اخترق نظمًا لجوجل، و أدوبي، و لوكهيد مارتين.\r\n6- مراكز خدمة اتصالات الجرائم متعددة اللغات\r\nهؤلاء الموظفون سيلعبون أي دور توده، مثل تقديم شهادات خبرة أو تدريب، بدء عملية نقل أموال، إعادة تشغيل حسابات مخترقة. المكالمة تكلفك مايقرب من 10 دولارات.\r\nكيفية الوصول إلى برمجيات الشبكة المظلمة\r\n\u2013 المتصفحات السرية\r\nتور Tor وهو اختصار أونيون راوتر، هو واحد من البرامج العديدة التي تفتح بابًا للشبكة المظلمة. يقوم تور بتعديل اتجاه الإشارة عبر 6000 سيرفر ليخفي مصدر طلب الوصول لصفحة معينة، مما يجعل الضغطات على روابط ممنوعة لا يمكن اقتفاء أثرها من قبل السلطات. المتصفح يستخدم صفحات سرية متبوعة ب (.onion) بدلا من (.com) والي لا يمكن الوصول إليها إلا من خلال متصفح تور.\r\n\u2013 محركات البحث السرية\r\nفي أواسط عام 2014، اخترع الهاكرز محرك بحث جرامز Grams، وهو محرك البحث الأول في الشبكة المظلمة الذي تم توزيعه بنطاق كبير. يتيح جرامز للمجرمين المستقبليين البحث عن المخدرات و السلاح و حسابات البنوك المسروقة عبر العديد من المواقع المخفية. الأدهى أنها تحتوي على زر \u201cضربة حظ\u201d I\u2019m Feeling Lucky و يحتوي على إعلانات استهدافية، حيث يقوم مروجو المخدرات بالتنافس على معدلات المرور.\r\n\u2013 موسوعات الجريمة\r\nموسوعات منظمة بعناية تحتوي على قوائم مبوبة بأنواع الجريمة، مثل الاختراق، الأسواق، الفيروسات، و المخدرات. يساعد الوصف المتاح لكل باب في تعريف القادمين الجدد بالموضوع و في توصيلهم بموادهم الإجرامية المفضلة.\r\n\u2013 غرف الدردشة الخفية\r\nمثل العالم الحقيقي تمامًا، كل مجرم يسعى للوصول إلى مواد إجرامية يجب أن يدخل من خلال توصية قبل أي تعامل معه. هناك شبكة من غرف الدردشة والمنتديات التي لا يمكن دخولها إلا من خلال دعوة، مخفاة خلف عناوين ويب غير مدرجة تتكون أسماؤها من حروف وأرقام، تتيح الدخول إلى أعتى الشبكات الإجرامية.\r\n[1] ماريانا ترينش Mariana Trench هي أعمق نقطة في محيطات العالم، و تقع في غرب المحيط الهادي.\r\n[2] ليكسيز-نيكسيز LexisNexis شركة نشر أميريكية تتيح قاعدة بيانات ضخمة للأبحاث القانونية و التجارية، تشمل النشرات والدراسات و التغطيات الإخبارية وغيرها.\r\n[3] Pedophiles الأشخاص الذين ينجذبون جنسيًا إلى الأطفال\r\n[4] Liberty Reserve شركة كانت تقدم خدمات الدفع الآمنة عبر الانترنت بواسطة العملات الرقمية، تم إغلاقها بواسطة حكومة الولايات المتحدة الأميريكية في 2013 بسبب استخدام خدماتها في أنشطة إجرامية لا يمكن تتبعها.","post_author":"1","post_excerpt":"","post_date":"December 20, 2016","post_date_gmt":"December 20, 2016","comment_status":"open","ping_status":"open","post_name":"%d8%a7%d9%84%d9%88%d9%8a%d8%a8-%d8%a7%d9%84%d8%ae%d9%81%d9%8a-%d8%a7%d9%84%d8%af%d9%8a%d8%a8-%d9%88%d9%8a%d8%a8","post_modified":"December 20, 2016","post_modified_gmt":"December 20, 2016","post_content_filtered":"","post_parent":"0","menu_order":"0","comment_count":"0","featuredimage":"","featuredthumb":"","taxonomies":[],"category":[{"id":"1","name":"Uncategorized","slug":"uncategorized","description":"","count":"11","parent":"0","image":"Plugin Categories Images must be enabled","custom_fields":"ACF plugin needs to be enabled, Back to documentation for further information"}],"tags":[],"author":[{"ID":"1","user_login":"sabri","user_nicename":"sabri","user_email":"sabri.sniperdw@gmail.com","user_url":"","user_registered":"December 20, 2016","display_name":"sabri","role":{"administrator":true},"first_name":"","last_name":"","nickname":"sabri","description":"","avatar":"http://2.gravatar.com/avatar/2565f560c372c957c8a3a3426447b0bb?s=96&#038;d=mm&#038;r=g","aim":"","jabber":"","yim":"","custom_fields":"ACF plugin needs to be enabled, Back to documentation for further information"}],"post_format":false,"custom_fields":"ACF plugin needs to be enabled, Back to documentation for further information"},{"ID":"21","post_title":"اول شرح ل جهاز مستوحى من العقل البشري ل تشغيل الانظمة الاصطناعية","guid":"http://codelab.d3stud.io/?p=21","post_content":"أظهر بحث جديد بجامعة «ساوثهامبتون»، أن جهازًا نانويًا يدعى «الذاكرة المقاومة \u2013 Memristor» يمكن استخدامه لتشغيل أنظمة اصطناعية تحاكي دماغ الإنسان.\r\nتُظهر «الشبكات العصبونية الاصطناعية \u2013 (Artificial Neural Networks (ANNs» قدرةً على التعلم وتنفيذ مهماتٍ صعبةٍ مقارنة بالأنظمة الحاسوبية المتداولة مثل «التعرف على الأنماط»، التعلم عن طريق الانترنت والتصنيف. التطبيقات العملية لتلك الشبكات الاصطناعية معرقلةٌ حاليًا بسبب غياب «مشابك عصبية \u2013 Synapses» اصطناعية فعّالة والتي تعد مكونات أساسية تحتاجها كل «شبكة عصبونية اصطناعية» بأعداد كبيرة.\r\nفي الدراسة التي نشرت على الدورية العلمية «Nature Communications»، قام فريق بحث جامعة «ساوثهامبتون»، تجريبيًّا، بشرح نظامٍ عصبيٍّ اصطناعي استَخدم «مشابكَ عصبيةٍ» ذات «ذاكرة مقاومة» تدعم قواعدَ تعلُّمٍ معقّدةٍ من أجل إنجاز التعلم المعكوس المدخلة للبيانات المتقلبة.\r\n«الذاكرة المقاومة» هي مكون كهربائي وظيفته تحديد أو تعديل مرور التيار في الدائرة الكهربائية، كما يقوم بتسجيل كمية الشحنة الكهربائية التي مرت خلاله ويمكنه الاحتفاظ بتلك البيانات حتى بعد قطع الطاقة الكهربائية.\r\nيقول الدكتور «أليكس سيرب \u2013 Alex Serb»، من قسم علم الحاسوب والإلكترونيات بجامعة «ساوثهامبتون»: «إذا أردنا بناء أنظمةٍ اصطناعيةٍ تستطيع محاكاة العقل البشري من حيث الأداء والقوة، فنحن نحتاج إلى استخدام مئات المليارات، أو ربما ترليونات من «المشابك العصبية الاصطناعية» والتي يجب أن تكون قادرةً على تنفيذ قواعدَ تعلمٍ مختلفةٍ من حيث درجة التعقيد. على الرغم من أن المكونات الإلكترونية المتاحة حاليًّا بإمكانها صنع «التشابكات العصبية الاصطناعية» المطلوبة، فإنه سيكون من الصعب توفير الطاقة ومؤشرات الكفاءة المطلوبة بدون تصميم مكوناتِ «مشبكٍ عصبيٍّ» جديدة».\r\nويضيف: «توفر «الذاكرة المقاومة» طريقا ممكنا لتحقيق ذلك الهدف، وذلك بفضل دعمها لميزات أساسية في «نقاط التشابك العصبي» (تخزين الذاكرة، التعلم على الإنترنيت، تطبيق قاعدة تعلمية قوية حاسوبيا، بنية ثنائية النهايات) في أحجام عالية التراص وبتكلفة قليلة للطاقة. إن كانت الأدمغة الاصطناعية ستصبح حقيقة يوما ما، فإن ذلك سيكون حتما عن طريق «نقاط التشابك العصبي» ذات الذاكرة المقاومة».\r\nتماما كالمشابك العصبية للدماغ، تمكنت مصفوفة «الذاكرة المقاومة» المكونة من أوكسيد-الفلز من تعلم وإعادة تعلم الأنماط المدخلة بطريقة غير مراقبة ضمن شبكة احتمالية من نوع «الفائز يأخذ كل شيء \u2013 (Winner-Take-All (WTA». وهذا مهم للغاية لتشغيل المعالجات المدمجة المنخفضة الطاقة (اللازمة لإنترنيت الأشياء \u2013 Internet of Things) التي يمكنها معالجة بيانات كبيرة في «الوقت الحقيقي» (Real-Time) من دون معرفة مسبقة بالبيانات.\r\nيقول الدكتور «ثيمس برودروماكس \u2013 Themis Prodromakis»، أستاذ محاضر في النانو-إلكترونيات وعضو في «مجلس البحث في الهندسة وعلوم الفيزياء» بجامعة «ساوثهامبتون»: «ما يعيق الاستفادة من أية تكنولوجيا جديدة هو قلة التوضيحات التي تعرض، عمليا، فوائدها ومزاياها. العمل الذي نقوم به يثبت أن مقاومات الذاكرة النانوية يمكن استخدامها في تكوين دوائر عصبية تعالج بيانات كثيرة في «الوقت الحقيقي» (Real-Time)، وهو ما يعد تحدٍ رئيسي للمجتمع الحديث».\r\nويختم «برودروماكس»: «لقد وضحنا ان هذه التكنولوجيا يمكنها بشكل مستقل أن تتكيف مع بيئتها بدون تدخل الإنسان وأنها مرنةٌ جدًّا في معالجة البيانات المتقلبة في «الوقت الحقيقي» بشكل موثوق. يمكن لهذا النوع من التكنولوجيا أن يجد عددًا كبيرًا من التطبيقات بدايةً من تكنولوجيا الاستشعار إلى مراقبة الوقود في البيئات القاسية وتلك التي يصعب ولوجها. وهي قدرات مرغوب فيها للغاية لتحقيق رؤية «إنترنيت الأشياء»».","post_author":"1","post_excerpt":"","post_date":"December 20, 2016","post_date_gmt":"December 20, 2016","comment_status":"open","ping_status":"open","post_name":"%d8%a7%d9%88%d9%84-%d8%b4%d8%b1%d8%ad-%d9%84-%d8%ac%d9%87%d8%a7%d8%b2-%d9%85%d8%b3%d8%aa%d9%88%d8%ad%d9%89-%d9%85%d9%86-%d8%a7%d9%84%d8%b9%d9%82%d9%84-%d8%a7%d9%84%d8%a8%d8%b4%d8%b1%d9%8a-%d9%84","post_modified":"December 20, 2016","post_modified_gmt":"December 20, 2016","post_content_filtered":"","post_parent":"0","menu_order":"0","comment_count":"0","featuredimage":"","featuredthumb":"","taxonomies":[],"category":[{"id":"1","name":"Uncategorized","slug":"uncategorized","description":"","count":"11","parent":"0","image":"Plugin Categories Images must be enabled","custom_fields":"ACF plugin needs to be enabled, Back to documentation for further information"}],"tags":[],"author":[{"ID":"1","user_login":"sabri","user_nicename":"sabri","user_email":"sabri.sniperdw@gmail.com","user_url":"","user_registered":"December 20, 2016","display_name":"sabri","role":{"administrator":true},"first_name":"","last_name":"","nickname":"sabri","description":"","avatar":"http://2.gravatar.com/avatar/2565f560c372c957c8a3a3426447b0bb?s=96&#038;d=mm&#038;r=g","aim":"","jabber":"","yim":"","custom_fields":"ACF plugin needs to be enabled, Back to documentation for further information"}],"post_format":false,"custom_fields":"ACF plugin needs to be enabled, Back to documentation for further information"},{"ID":"19","post_title":"دراسة علمية تبين قدرة الإنسان على نسيان الذكريات عمدا","guid":"http://codelab.d3stud.io/?p=19","post_content":"يلعب السياق الذي تأتي فيه المواقف اليومية دوراً كبيراً في ذكرياتنا، سواءً أكانت جيدة أم سيئة. فعلى سبيل المثال، عند سماعك لأغنية \u2018Born to Run\u2019 للمغني (Bruce Springsteen) من مذياع السيارة، قد تتذكر أولَ حب لك، أو أول مخالفة مرورية لتجاوز السرعة! ولكنّ دراسةً جديدةً لمسح الدماغ، أجراها فريق من كلية (Dartmouth) بالتعاون مع جامعة (Princeton)، تظهر قدرة الإنسان على نسيان الخبرات السابقة عمداً، إذا ما غيّر نظرته للمواقف التي ولّدت هذه الذكريات.\r\nإنّ التطبيقات الممكنة لنتائج هذه الدراسة ترتكز على تعزيز الذّكريات المرغوبة، كتطوير الأدوات التعليمية الجديدة أو توجيه الذكريات المؤلمة، بما فيها علاج اضطراب ما بعد الصدمة.\r\nنُشرت هذه الدراسة في مجلة Psychonomic Bulletin and Review .\r\nمنذ زمن الإغريق القدامى، علِم المُنظّرون في مجال الذاكرة أننا نستخدم سياق الأحداث التي نتعرض لها (بما فيه من مشاهد، وأصوات، وروائح، والمكان الذي نكون فيه، ومن كان معنا في ذلك الحين\u2026) لننظّم ذكرياتنا ونستعيدها. ولكنّ الفريق أراد معرفة ما إذا كان باستطاعة الإنسان نسيانَ تجاربه السابقة عمداً، وكيفية حدوث ذلك. فقد صمم أعضاء الفريق تجربة تصوير بالرنين المغناطيسي الوظيفي (fMRI) ليتعقبوا بالتحديد الأفكارَ المرتبطة بالذكريات، كما أضافوا لمسة جديدة على تقنية بحث نفسية، في حفظ مواضيع وتذكر كلمات غير مترابطة، تعود لقرون من الزمن. ففي الدراسة الجديدة، عرض الباحثون على المشاركين صوراً لمشاهد في الهواء الطلق (كالغابات، والجبال والشواطئ\u2026) أثناء دراستهم لقائمتين من الكلمات العشوائية، ثم طلبوا منهم أن ينسَوا كلمات القائمة الأولى قبل دراسة الثانية التي سيطلبون منهم تذكرها فيما بعد.\r\nقال قائد الفريق، جيرمي مانينغ (Jeremy Manning)، بروفسور مساعد في العلوم النفسية وعلوم الدماغ في كلية (Dartmouth): «كان أملُنا أنّ صور المَشاهد ستشكّل خلفيةً أو سياقاً ما لدى الناس بينما هم يدرسون الكلمات، ليحيطوا بالأفكار المرتبطة بالمشهد. فاستخدمنا تقنية الـ(fMRI) لمعرفة كم من الوقت يفكّر الناس بالأشياء المرتبطة بالمشهد في كل لحظة من هذه التجربة، ما سمح لنا بتعقّب كيف يمكن للتمثيل العصبي لهذه المشاهد والمعاني أن يتركّز في فكر الإنسان أو يتلاشى منه مع مرور الوقت».\r\nمباشرةً، بعد أن طُلبَ من المشاركين أن ينسَوا الكلمات التي درسوها أثناء مشاهدتهم للصور، أظهرَ الرّنين المغناطيسي أنهم أخرجوا النشاط المرتبط بالمشهد من عقولهم تماماً.\r\nيقول مانينغ: «إنها تشبه دفعَ الأفكار بعيداً عن طعام الجدة عمداً، عندما لا تريد التفكير بجدتك في هذه اللحظة». ويضيف: «لقد تمكنّا من قياس وتحديد هذه العملية فيزيائياً باستخدام بيانات الدماغ».\r\nولكن، عندما طُلب من المشاركين تذكّرَ القائمة الثانية، لم يتم التخلص من الأفكار المتعلقة بالمشهد كما حدث سابقاً، علاوة على ذلك فإنّ كمية الأفكار المتعلقة بالمشاهد التي تخلص منها المشاركون تكهنت بعدد الكلمات المدروسة التي سيتم تذكّرها لاحقاً، ما يظهر أنّ هذه العملية فعالة لتسهيل النسيان.\r\nكان لهذه الدراسة تأثيران هامان، على حد قول مانينغ: «أولاً، كانت أغلبُ دراسات الذاكرة معنيةً بكيفية التذكّر بدلاً من كيفية النسيان، ويُعرض النسيان عادة على أنه (فشل) في بعض الأحاسيس، ولكنه أحياناً يكون له فوائد. فعلى سبيل المثال، قد يريد البعض نسيانَ حدثٍ صادم، كالجنود الذين يعانون اضطرابَ ما بعد الصدمة (PTSD)، أو التخلص من بعض المعلومات القديمة للتركيز على تعلم مواد جديدة، فقد عرّفت دراستُنا آليةً تدعم هذه العمليات».\r\nأمّا التأثير الثاني فلم يكن واضحاً كسابقه، ولكنه هام. يقول مانينغ: «إنّ من الصعوبة بمكان تحديدَ التمثيل العصبي للمعلومات السياقية، فإذا أخذنا بعين الاعتبار السياق الذي خضتَ فيه تجربةً ما، فإننا نشير فعلاً إلى مجمّعٍ كبيرٍ جداً من الأفكار العشوائية التي حصلت عليها من هذه التجربة. من المحتمل أن تكون هذه الأفكار غريبة عنك إذا ما نظرت إليها كلاً على حدة، ولكنها قد تصبح مفهومة بالنسبة لك إذا ما جاءت في السياق الأصلي نفسه. لذلك فإنّ تعقّب التمثيل العصبي لهذه الأشياء مهمةٌ صعبةٌ للغاية لأننا نملك مقياساً واحداً فقط لسياق محدد. وأيضاً، لا يمكن برمجة حاسوب ليعرف كيف يبدو شكل هذا السياق في الدماغ، لأنه هدف متحرك ومتطور باستمرار. في دراستنا هذه، تلافينا هذه الثغرة باستخدام معالجة تجريبية غير مألوفة، فقد وجّهنا الناس لدمج صور المشاهد مع الأفكار التي حصلوا عليها أثناء دراستهم لكلمات جديدة. وعندما أصبحت هذه المشاهد شائعةً بين المشاركين مع مرور الوقت، تمكنّا من استخدام الـ(fMRI) لتعقّب التمثيل الذهني المرتبط بها من لحظة إلى أخرى».","post_author":"1","post_excerpt":"","post_date":"December 20, 2016","post_date_gmt":"December 20, 2016","comment_status":"open","ping_status":"open","post_name":"%d8%af%d8%b1%d8%a7%d8%b3%d8%a9-%d8%b9%d9%84%d9%85%d9%8a%d8%a9-%d8%aa%d8%a8%d9%8a%d9%86-%d9%82%d8%af%d8%b1%d8%a9-%d8%a7%d9%84%d8%a5%d9%86%d8%b3%d8%a7%d9%86-%d8%b9%d9%84%d9%89-%d9%86%d8%b3%d9%8a%d8%a7","post_modified":"December 20, 2016","post_modified_gmt":"December 20, 2016","post_content_filtered":"","post_parent":"0","menu_order":"0","comment_count":"0","featuredimage":"","featuredthumb":"","taxonomies":[],"category":[{"id":"1","name":"Uncategorized","slug":"uncategorized","description":"","count":"11","parent":"0","image":"Plugin Categories Images must be enabled","custom_fields":"ACF plugin needs to be enabled, Back to documentation for further information"}],"tags":[],"author":[{"ID":"1","user_login":"sabri","user_nicename":"sabri","user_email":"sabri.sniperdw@gmail.com","user_url":"","user_registered":"December 20, 2016","display_name":"sabri","role":{"administrator":true},"first_name":"","last_name":"","nickname":"sabri","description":"","avatar":"http://2.gravatar.com/avatar/2565f560c372c957c8a3a3426447b0bb?s=96&#038;d=mm&#038;r=g","aim":"","jabber":"","yim":"","custom_fields":"ACF plugin needs to be enabled, Back to documentation for further information"}],"post_format":false,"custom_fields":"ACF plugin needs to be enabled, Back to documentation for further information"},{"ID":"16","post_title":"10 من أغرب الحالات الطبية المعروفة","guid":"http://codelab.d3stud.io/?p=16","post_content":"إذا ظننت أن الزومبي، مصاصي الدماء، والمستئذبين ضربٌ من ضروب الخيال، فعليك إعادة التفكير في ذلك حين تقرأ هذه الحالات الطبية العشر الغريبة:\r\n1- متلازمة الرجل المتحجر \u201cخلل التليف التعظّمي المتقدم\u201d\r\nFibrodysplasia ossificans progressiva (FOP)\r\nمرض جيني يتقدم على عدة مراحل ويقوم بتحويل الأنسجة اللينة إلى عظام مع مرور الوقت. يوجد جين ACVR1 في العظام، العضلات، الأربطة، والأوتار ويقوم هذا الجين بتنظيم النمو والتطور في هذه الأنسجة كما أنه مسئول عن تحول الغضاريف إلى عظام أثناء تحول الطفل إلى إنسان بالغ. ولكن طفرات هذا الجين قد تتسبب في فقدان السيطرة على عملية \u201cالتعظّم\u201d تلك مما قد يحوّل العضلات الهيكلية إلى عظام ويتسبب في التحام المفاصل مع بعضها البعض. لذا ففي النهاية يتحول مريض الـFOP إلى تمثال.\r\nيحدث هذا المرض في شخص من بين كل 2 مليون فرد ولايوجد حاليًا له أي علاج. تقوم الصدمات بزيادة سرعة هذه العملية لذا تتسبب المحاولات الجراحية لإزالة العظام في إنتاج عظم أكثر في المنطقة.\r\n2- متلازمة الجثة المتحركة: وهم كوتراد (Cotard\u2019s Delusion)\r\nلايُعتبر وهم كوتراد ظاهرةً جسديةً، بل يُعد خلل عقلي نادر يتسبب في أن يظن المريض أنه يفتقد جزءًا من جسده، مثل المخ، أو يظن المريض أنه ميت حقًا. يميل المصابون إلى التوقف عن الأكل والاستحمام، وإلى قضاء معظم أوقاتهم في المقابر لإحساسهم بالانتماء إليها.\r\nتم ربط هذا المرض بخلل في بعض المناطق في الدماغ التي تكون مسئولة عن التعرف على وربط المشاعر بالوجه، ومن ضمن هذه المشاعر، مشاعر وجه الفرد نفسه. يتسبب هذا الخلل في انعزالًا عاطفيًا تامًا وفقدان أي إحساس بالهوية حين ينظر المرء لجسده. توجد أدوية متاحة لهذه المشكلة، ولكن علاج الصدمات الكهربائية كان أكثر فعاليةً في تخفيف تلك الحالات.\r\n3- حساسية من البرد: الأرتيكاريا الباردة (Cold Urticaria)\r\nمع اقتراب الشتاء في نصف الكرة الأرضية الشمالي، يستعد المصابون بالحساسية من البرد لهذا الموسم الصعب عليهم. الاتصال بالهواء أو المياه الباردة يتسبب في إطلاق الهيستامين كرد فعل، بالضبط مثلما يحدث حين تقرصك نحلة أو حين يكون لديك حساسية من الفول السوداني. المصابون بالنوع المتقدم من هذه الحساسية يشعرون بتورمات كبيرة في الحلق واللسان، مما قد يؤدي إلى موتهم.\r\nلايزال غامضًا السبب الرئيسي لهذه الحالة، ولكن يمكن علاجها بمضادات الهيستامين، مثلما يتم علاج أي حساسية أخرى.\r\n4- متلازمة الرجل الشجرة: خلل ليواندوسكي لوتز التنسجي: خلل تنسج البشرة الثؤلولي (Epidermodysplasia Verruciformis)\r\nتظهر هذه الحالة على صورة تشبه لحاء الشجرة الذي ينمو من على جلد المريض. بالطبع، ها النسيج ليس لحاء شجرة حقيقي. إنها مجرد ثآليل يمكن أن تزيد بالتعرض لضوء الشمس. يمكن أن تكون هذه الثآليل حميدة في المراحل المبكرة من السن ولكن سرعان ماتتحول إلى خبيثة مع التقدم في العمر. تظهر هذه الثآليل بسبب طفرة جينية نادرة في جيني EVER1/EVER2. لاتزال وظيفة هذين الجينين غامضة ولكن تتسبب طفراتهم في جعل المرء معرضًا للإصابة بفيروس الورم الحليمي البشري 5 و8 والتي لا تتسبب عادةً في ظهور أمراض. توجد بعض العلاجات التي تقوم بتخفيف حدة الأعراض، ولكن لايوجد علاج تام للمرض.\r\n5- متلازمة مصاص الدماء: جفاف الجلد المصطبغ (Xeroderma Pigmentosum)\r\nيحتاج البشر لأشعة الشمس لتصنيع فيتامين د ولكن التعرض الزائد لها يتسبب في ضرر البشرة بسبب الأشعة فوق البنفسجية. يُصاب 1 من كل مليون فرد بهذا المرض وتزداد حساسيته للأشعة فوق البنفسجية. يجب حماية هؤلاء المرضى من أشعة الشمس تمامًا وإلا سيتعرضون لحرقات شمس وتهدمات في البشرة. يمكن أن تتطور هذه الحالة بسهولة إلى سرطان جلد.\r\nسبب Xeroderma Pigmentosum هو طفرة جينية نادرة لإنزيمات إصلاح النيوكليوتيدات بالطريقة النازعة. حين تعمل هذه الإنزيمات بسلاسة فإنها تقوم بمعالجة الـDNA التالف الذي ينشأ من التعرض للأشعة الفوق بنفسجية. المصابون بهذه الحالة لايتمكنون من إصلاح هذه الطفرات والتلفيات حين يتعرضون للأشعة فوق البنفسجية، مما يؤدي إلى تراكم الطفرات. توجد علاجات متوافرة، ولكن لايزال أفضل علاج هو تجنب الشمس، بالضبط مثل مصاصي الدماء.\r\n6- داء الفيل (Elephantiasis)\r\nينشأ هذا المرض من انسداد في الأوعية الليمفاوية مما يؤدي إلى تورمات عملاقة في الجلد والأنسجة، خاصةً في القدم وفي الخصيتين. هذه الحالة التشوهية قد تنشأ من عدة طرق، وأشهرها هي قرصة بعوضة تحمل هذا الطفيل. يوجد أكثر من 40 مليون مصاب بهذا المرض.\r\nتوجد علاجات متوفرة لقتل الطفيل، لذا فالتدخل المبكر يجلب أفضل النتائج. توجد أيضًا خيارات جراحية إذا أثّر داء الفيل على الخصية، ولكن لاتتوافر هذه الخيارات في حالة الأطراف.\r\n7- متلازمة الرجل المستذئب: متلازمة أمبراس: فرط الشعر (Hypertrichosis)\r\nتستطيع العديد من النساء تقليم حواجبهن لإزالة بعض الشعريات التي تنمو خارج خط الحاجب المرغوب، ولكن هذا ليس بالخيار المتاح على الإطلاق لمرضى Hypertrichosis. قد تكون وجوههم مغطاة تمامًا بالشعر، ولذا سُميت هذه الحالة بـ\u201dمتلازمة الرجل المستذئب\u201d.\r\nقد تكون هذه الحالة نتيجة تشوه خلقي أو نتيجة مرض آخر. المرضى الذين يولدون بهذه الحالة قد يعانون من العديد من التشوهات الجينية. بينما يحصل المرضى الذين لايولدون بهذه الحالة عليها نتيجة آثار جانبية من العلاجات المضادة للصلع (إحذر مما تتمناه). تتضمن أساليب العلاج إزالة الشعر بأي طريقة ممكنة، حيث أن إزالة الشعر بالشمع وبالليزر لاتؤدي إلى ظهور نتائج تدوم لفترة طويلة.\r\n8- حساسية المياه: أرتيكاريا المياه (Aquagenic urticaria)\r\nبسبب أن معظم جسمنا يتكون من المياه، فإن هذه الظاهرة تبدو أمرًا غريبًا جدًا. مع أنها ليست حساسية حقيقية لأها لاتؤدي إلى إطلاق الهيستامين، إلا أنها تتسبب في ظهور بَثر يحكها المرضى بعد بضع دقائق من التعرض للماء.\r\nتوجد أقل من 100 حالة موثقة لهذه الحالة، ولايوجد سبب محدد حتى الآن. يظن البعض أن الماء ليس هو السبب، ولكن كيماويات أو ملوثات محددة منتشرة في الماء. أكثر العلاجات فعالية هو دهان مرهم كابسايكين capsaicin على الجلد لإزالة الألم.\r\n9- متلازمة اليد الغريبة (Alien Hand Syndrome)\r\nعبارة \u201cاليد اليمنى لاتعلم ماتفعله اليسرى\u201d تصبح حرفية لبعض الناس. تتضمن هذه الحالة يدًا تتحرك بصفة مستقلة عن التحكم العقلي، حيث أنها تمسك الأجسام وتتحرك بطريقة مخالفة لما يرغبه الفرد.\r\nتنشأ هذه الحالة كأثر جانبي نادر لبعض الإصابات المخية أو عند قطع الجسم الثفني (الذي يربط نصفي المخ الكرويين ببعضهما البعض). لايوجد علاج لهذه الحالة سوى شغل اليد بوظائف أخرى.\r\n10- متلازمة اللهجة الأجنبية (Foreign Accent Syndrome)\r\nقد تكشف اللهجات عن العديد من المعلومات المتعلقة بالفرد من حيث مكان ولادته، مكان تربيته، لغته الأصلية، وهكذا. ولكن بعض الناس يتحدثون بلهجات غريبة لأسباب خارجة عن إرادتهم بسبب هذه الحالة، بالرغم من عدم زيارتهم لأي منطقة خارج محل ولادتهم من قبل. قد يستخدم المريض العديد من اللهجات في أوقات مختلفة أو قد يدمج هذه اللهجات معًا في جملة واحدة.\r\nتأتي هذه الحالة النادرة عادةً كأثر جانبي لجلطة مخية أو إصابة مخية أخرى. لايقوم المُصاب بتغيير نبرة الصوت فقط، ولكن أيضًا يقوم بتغيير موقع لسانه أثناء الحديث. العلاج الوحيد لهذه الحالة هو التدريب المكثف على الحديث لإعادة تدريب المخ على الحديث بطريقة معينة.","post_author":"1","post_excerpt":"","post_date":"December 20, 2016","post_date_gmt":"December 20, 2016","comment_status":"open","ping_status":"open","post_name":"10-%d9%85%d9%86-%d8%a3%d8%ba%d8%b1%d8%a8-%d8%a7%d9%84%d8%ad%d8%a7%d9%84%d8%a7%d8%aa-%d8%a7%d9%84%d8%b7%d8%a8%d9%8a%d8%a9-%d8%a7%d9%84%d9%85%d8%b9%d8%b1%d9%88%d9%81%d8%a9","post_modified":"December 20, 2016","post_modified_gmt":"December 20, 2016","post_content_filtered":"","post_parent":"0","menu_order":"0","comment_count":"0","featuredimage":"","featuredthumb":"","taxonomies":[],"category":[{"id":"1","name":"Uncategorized","slug":"uncategorized","description":"","count":"11","parent":"0","image":"Plugin Categories Images must be enabled","custom_fields":"ACF plugin needs to be enabled, Back to documentation for further information"}],"tags":[],"author":[{"ID":"1","user_login":"sabri","user_nicename":"sabri","user_email":"sabri.sniperdw@gmail.com","user_url":"","user_registered":"December 20, 2016","display_name":"sabri","role":{"administrator":true},"first_name":"","last_name":"","nickname":"sabri","description":"","avatar":"http://2.gravatar.com/avatar/2565f560c372c957c8a3a3426447b0bb?s=96&#038;d=mm&#038;r=g","aim":"","jabber":"","yim":"","custom_fields":"ACF plugin needs to be enabled, Back to documentation for further information"}],"post_format":false,"custom_fields":"ACF plugin needs to be enabled, Back to documentation for further information"},{"ID":"15","post_title":"الديجافو ، حقيقة أم هلوسة؟","guid":"http://codelab.d3stud.io/?p=15","post_content":"الديجافو ، حقيقة أم هلوسة؟\r\nألم يتسلل إليكَ من قبل شعور بارد اقشعر له بدنك وندهش له ذهنك بأن اللحظة التي أنت فيها قد تكررت من قبل.. بحذافيرها \u200d!\r\nأي انك وأنت جالس مع أصدقائك .. أو حين تمر في مكان معين تشعر بأن هذا الموقف قد حدث لك من قبل، وأنك قد شاهدت هذا المكان وهذا الموقف من قبل لكن أين .. ؟ وكيف .. ؟\r\nالشعور لا يدوم طويلاً .. إنما هو فقط يومض بقوة مرة واحدة ويتلاشى في جزءٍ من الثانية.. مخلفاً وراءه سحباً من الإبهام والغموض تعيقك عن اللحاق به لفهمه بشكل أفضل وأعمق ..وبانقشاع تلك السحب يكون هو قد اختفى وتكون أنت قد نسيت الأمر برمته !\r\nلعل أغلبنا قد مر بتلك التجربة أو هذه الظاهرة.. والجميع يتساءل عن كيفية وسبب حدث هذا الأمر .. هذه الحيرة أيضاً كانت تلازم علماء النفس والطبيعة والفلاسفة الذين انشغلوا كثيراً للإجابة على سبب وكيفية حدوث هذه الظاهرة، الذين أطلقوا عليها ظاهرة الـ (ديجافو)\r\nالديجافو Deja Vu كلمة فرنسية تعني\u201d قد حدث من قبل\u201d وتعني حرفياً بالإنجليزي already seen وهي الإحساس بالألفة مع شيء يُفترض أنه ليس كذلك، مثال: تسافر لمكان لأول مرة في حياتك وتدخل مطعم مع أصدقائك وتجلسون إلى الطاولة وتتناولون عشائكم بينما تتناقشون في موضوعٍ ما وفجأة دون مقدمات ينتابك الشعور بأنك قد مررت بهذه اللحظة (بكل ما فيها) من قبل.. نفس المكان، نفس العشاء، نفس الموضوع، نفس الأوجه المحيطة بك .. كل شيء، كأنه حدث من قبل .. ولكن أين ؟ متى ؟ لا تتذكر ! وليس هذا فقط .. بل إنك قد تتذكر ما سيحصل في الثواني القادمة (كأن يسقط شيء أو يمر شخص ما أو أي شيء) وفعلاً يحدث !\r\nفرضيات لتفسير الظاهرة \u2026. :\r\nالمحللون النفسيون يرون في الديجافو تعبيراً عن رغبة قوية لتكرار تجربة ماضية، أما الأطباء فيفسرونها على أنها حدوث عدم مطابقة ( mismatching ) في الدماغ يتسبب في جعل الدماغ يخلط بين الإحساس بالحاضر والماضي ، أما علماء ما وراء الطبيعة فهم يعتقدون أن الديجافو يتعلق بخبرة حياتية ماضية عشناها قبل قدومنا إلى الدنيا في ذواتنا الحالية!و تلك ظاهرة أخرى تعرف ب \u201d تجربة ما قبل الولادة BBE\u201d (اختصاراً لكلمة Before Birth Experience )وعلى الرغم من التقدم العلمي على جميع الأصعدة الطبية إلا أن الغموض لا زال يكتنف ظاهرة ديجافوو رغم الفرضيات والتخمينات التي حاولت تعليلها إلا أنّ أياً منها لا يمكن البت به بشكل قاطع والمثير أكثر أنّ هناك ظاهرة معاكسة للديجافو ! إنها ما يسمى بال Jamais Vu وهي الإحساس بأن (المألوف) غريب وجديد وكأنه يُصادف لأول مرة! وأيضاً لا يدوم هذا الإحساس إلا لجزء من الثانية .كأن تجلس مع أحد أصدقائك أو أفراد عائلتك ولوهلة تشعر وكأنك لم تره من قبل! كأنه شخص غريب !\r\nالبحث العلمي\r\nالتفسير العلمي الأكثر دقة لهذه الظاهرة ربما يرجع إلى شذوذ الذاكرة حينما تعطي مشاعر خاطئة تقول للمخ بأننا عشنا هذا الموقف من قبل لكننا لا نستطيع تذكر تفاصيل الموقف \u201cالسابق\u201d (أين, متى, كيف). عندما يمر الوقت, الشخص يستطيع استرجاع بعض التفاصيل المشوّشة في الحادثة الجديدة ولكن من المستحيل استرجاع تفاصيل الحالة الأولى (والتي كانت في بالهم عندما كانوا في الحادثة الجديدة!) وهذا عادة ما يكون بسبب تشابك في الأعصاب المسؤولة عن الذاكرة قصيرة المدى والذاكرة طويلة المدى. الأحداث تتخزن في الذاكرة قبل أن تذهب إلى قسم الوعي في المخ البشري وتعالج هناك.\r\nهناك أيضا تفسير علمي آخر لظاهرة (دَيْ چاڤو) وهذا التفسير يتعلق بحاسة النظر. النظرية تقول بأن إحدى العينان تسجل الحادثة أسرع قليلاً عن العين الأخرى, فبعد لحظات قصيرة عندما تقع الحادثة, يُخيل لنا بأننا رأينا هذا الموقف من قبل! لكن من عيوب هذه النظرية أنها لا تقدم تفسير لتداخل الحواس الأخرى في الحادثة, كالسمع واللمس (كأن نشعر بأن أحداً من قبل ضرب يدنا اليسرى). وأيضا من عيوب هذه النظرية بأن الــ(دَيْ چاڤو) حدث عند أُناس لا يرون إلا بعين واحدة (أعور). على كل حال هذه الظاهرة يمكن تفسيرها بشكل عام بقول أن هناك عدم توافق زمني في تسجيل الأحداث في نصفي الدماغ الأيمن والأيسر.\r\nفرضية مراكز الذاكرة في الدماغ\r\nتفسر هذه الظاهرة علمياً على أن المخ عبارة عن مناطق وكل منطقة مسؤولة عن وظيفة مثال: الرؤية تكون في مؤخرة الرأس، السمع على الجوانب وهكذا.وما يحدث أنك عندما ترى شيئا يترجمه الجزء الخاص بالرؤية Visual Center وهذه هي وظيفته ترجمة الإشارات إلى صورة فقط أما فهم هذه الصورة واستيعابها أو تذكرها إذا كانت مألوفة يكون في جزء آخر يسمى Cognitive Center في هذه الظاهرة يحدث في بعض الأحيان تأخر بين العمليتين وتمر برهة من الوقت تدخل فيها الصورة إلى مركز الذاكرة قبل ال Cognitive Center .. ثم تذهب الصورة إليه لاحقا فيظن المخ أنه رآها من قبل.وتحليل آخر يرجع هذا الأمر إلى أن تواجدك في هذا المكان أو الموقف يترجم الأحداث إلى إشارات في الأعصاب، فترسل الأعصاب هذه الإشارات إلى مركز الذاكرة القصيرة (Short Memory) ليتم حفظها هناك وتكون هذه العملية سريعة جداً أقل من جزء من الثانية.. ولكن يحدث في بعض الأحيان أن ترسل الأعصاب نفس الإشارات إلى مركز الذاكرة الطويلة (long memory) بالخطأ.. فنشعر بان هذا الموقف قد مرنا بنا من قبل!! وللعلم مركز الذاكرة الطويلة هي المكان الذي يحفظ فيه أحداث قديمه يمكن استرجاعها مع الزمن .\r\nفرضية نصفي الكرة المخية\r\nجميعنا يعلم أن الدماغ مكون من فصين أي جزئين .. أحد هذه الأجزاء متقدم قليلا أي بارز قليلا عن الآخر .. وعند إستقبال الدماغ لأي إشارة أو صورة .. يستقبلها الفصين معا .. لكن في بعض الأحيان.. يستقبل ذلك الجزء البارز أو المتقدم قبل الأخر بثواني بسيطة جدا.. ثم ترسل للجزء الأخر الذي به يتم الاستيعاب الكامل لكل ما نستقبله من صور وأصوات وإشارات ضوئية وغيرها.. فعندما يستوعب المرء المكان أو الصورة التي أمامه .. يشعر أنه قد رآها سابقا.. ولكن الصحيح .. أنه .. قد خزنها في الذاكرة القصيرة قبل أن يتم استيعابها كاملا.. كل هذا يتم في ثواني معدودة..\r\nاضطرابات نفسية\r\nبعض العلماء حاول إيجاد رابط بين ظاهرة (دي جافو) وبين بعض الأمراض النفسية كانفصام الشخصية والقلق ولكنهم فشلوا. ليس هناك أي علاقة بين هذه الظاهرة وبين هذه الأمراض. العلاقة الأقوى وُجِدَت بين (دي جافو) و مرض صرع الفص الصدغي في المخ. وهذه العلاقة قادت بعض العلماء للتأكيد بأن هذه الظاهرة هي نتاج لخلل في عملية تفريغ الشحنات الكهربائية في المخ. الكثير من الناس يشعر ب\u201dرعشة\u201d سريعة في بعض الحالات (قبيل النوم بلحظات), وهذه الرعشة يرجّح بأنها تحدث أثناء الـ(دي جافو) مما تسبب شعور خاطئ في الذاكرة. الذين يشعرون بهذه الرعشات على الدوام, يعانون من تكرار حالة (دي جافو) ولكن أغلبها يكون صوتي, حيث يُخيّل له بأنه سمع هذا الصوت من قبل.\r\nتأثير بعض الأدوية\r\nبعض الأدوية ترفع نسبة حدوث الـ(دي جافو). في عام ٢٠٠٢, تمكن عالمان من دراسة رجل ظهرت عليه علامات الـ(دي جافو) عندما تناول دواء الـ (أمانتادين) و (فَنيلبروبانولامين) لعلاج أعراض انفلونزا حلّت به. في الحقيقة, هذا الرجل أحبّ هذا الشعور وأكمل الدراسة وبدأ يزور طبيبه النفسي لتسجيل ما يشعر به. هذان العالمان وصلا لنظرية بأن الـ (دي جافو) هو نتيجة تأثير المعدلات العالية من مادة الـ(دوبامين)أحد الموصلات العصبيى للمخ على بعض الخلايا في الفص الصدغي للمخ.\r\nتفسيرات تعتمد على الذاكرة\r\nالشبه بين المقدمات التي تحفّز ظاهرة الـ(دي جافو) وبين تلك التي تحفّز بعض الذكريات في المخ هي تفسير آخر. أي أن بعض المشاعر الحالية تجلب لنا تفاصيل حوادث سابقة في الماضي فهنا تحدث ظاهرة الـ(دي جافو). هذا التفسير يتيح للعلماء تطوير العديد من الأبحاث التي من شأنها أن تخلق حالات (دي جافو) حسب الطلب لدراستها تحت ظروف علمية. بعض العلماء يعتقد بأن الـ(دي جافو) تتعلق بوظيفة الإدراك المألوف في الذاكرة. وأيضا هناك تفسير آخر يقول بأن الـ(دي جافو) ما هي إلا نتيجة معلومات قد تعلمناها من قبل ولكن نسيناها والآن استطعنا استرجاعها فيُخيّل لنا بأننا نعيش الموقف مرتين(المخ البشري لا يمسح أي معلومة سجلها وإن نسيناها).","post_author":"1","post_excerpt":"","post_date":"December 20, 2016","post_date_gmt":"December 20, 2016","comment_status":"open","ping_status":"open","post_name":"%d8%a7%d9%84%d8%af%d9%8a%d8%ac%d8%a7%d9%81%d9%88-%d8%8c-%d8%ad%d9%82%d9%8a%d9%82%d8%a9-%d8%a3%d9%85-%d9%87%d9%84%d9%88%d8%b3%d8%a9%d8%9f","post_modified":"December 20, 2016","post_modified_gmt":"December 20, 2016","post_content_filtered":"","post_parent":"0","menu_order":"0","comment_count":"0","featuredimage":"","featuredthumb":"","taxonomies":[],"category":[{"id":"1","name":"Uncategorized","slug":"uncategorized","description":"","count":"11","parent":"0","image":"Plugin Categories Images must be enabled","custom_fields":"ACF plugin needs to be enabled, Back to documentation for further information"}],"tags":[],"author":[{"ID":"1","user_login":"sabri","user_nicename":"sabri","user_email":"sabri.sniperdw@gmail.com","user_url":"","user_registered":"December 20, 2016","display_name":"sabri","role":{"administrator":true},"first_name":"","last_name":"","nickname":"sabri","description":"","avatar":"http://2.gravatar.com/avatar/2565f560c372c957c8a3a3426447b0bb?s=96&#038;d=mm&#038;r=g","aim":"","jabber":"","yim":"","custom_fields":"ACF plugin needs to be enabled, Back to documentation for further information"}],"post_format":false,"custom_fields":"ACF plugin needs to be enabled, Back to documentation for further information"}]
     */

    @SerializedName("respond")
    private int respond;
    @SerializedName("paging")
    private Paging paging;
    @SerializedName("message")
    private String message;
    @SerializedName("result")
    private List<Result> result;

    public int getRespond() {
        return respond;
    }

    public void setRespond(int respond) {
        this.respond = respond;
    }

    public Paging getPaging() {
        return paging;
    }

    public void setPaging(Paging paging) {
        this.paging = paging;
    }

    public String getMessage() {
        return message;
    }

    public void setMessage(String message) {
        this.message = message;
    }

    public List<Result> getResult() {
        return result;
    }

    public void setResult(List<Result> result) {
        this.result = result;
    }

    public static class Paging {
        /**
         * stillmore : 1
         * perpage : 5
         * callpage : 1
         * next : 2
         * previous : 0
         * pages : 3
         * result : 11
         */

        @SerializedName("stillmore")
        private int stillmore;
        @SerializedName("perpage")
        private String perpage;
        @SerializedName("callpage")
        private String callpage;
        @SerializedName("next")
        private int next;
        @SerializedName("previous")
        private int previous;
        @SerializedName("pages")
        private int pages;
        @SerializedName("result")
        private String result;

        public int getStillmore() {
            return stillmore;
        }

        public void setStillmore(int stillmore) {
            this.stillmore = stillmore;
        }

        public String getPerpage() {
            return perpage;
        }

        public void setPerpage(String perpage) {
            this.perpage = perpage;
        }

        public String getCallpage() {
            return callpage;
        }

        public void setCallpage(String callpage) {
            this.callpage = callpage;
        }

        public int getNext() {
            return next;
        }

        public void setNext(int next) {
            this.next = next;
        }

        public int getPrevious() {
            return previous;
        }

        public void setPrevious(int previous) {
            this.previous = previous;
        }

        public int getPages() {
            return pages;
        }

        public void setPages(int pages) {
            this.pages = pages;
        }

        public String getResult() {
            return result;
        }

        public void setResult(String result) {
            this.result = result;
        }
    }

    public static class Result {
        /**
         * ID : 22
         * post_title : الويب الخفي - الديب ويب
         * guid : http://codelab.d3stud.io/?p=22
         * post_content : الويب الخفي – الديب ويب: ربما تظن أنك تعرف الانترنت جيدًا، لكن مواقع مثل فيسبوك، أمازون، وانستاجرام، هي مجرد السطح الخارجي. هناك عالم آخر بكامله تحت هذا السطح: الشبكة العميقة.
         * هذه الأعماق هي المكان الذي يكون فيه تداول المعلومات مؤمنًا بكلمة سر، محميًا خلف أسوار المناطق غير المجانية، أو يحتاج إلى برمجيات خاصة للوصول إليه، وهو مكان في غاية الضخامة. يقدر البعض هذا الجزء بأنه يبلغ 500 ضعفًا من حجم الشبكة المنظورة التي يتصفحها الناس يوميًا. بالرغم من ذلك فهذا الجزء شبه غائب تمامًا عن النظر. فبحسب دراسة نشرت في نشرة “الطبيعة” Nature يقوم جوجل بتبويب ما لايزيد عن 16% من سطح الشبكة، و يغفل تمامُا كل الشبكة العميقة. أي محاولة بحث لا ينتج عنها إلا 0.03% من المعلومات الموجودة على الانترنت (صفحة من كل 3000 صفحة). يشبه الأمر القيام بالصيد في جزء يقل عمقه عن المتر في المحيط كله، هنا أنت تغفل “ماريانا ترينش”[1] التخيلي الكامن أسفل السطح.
         * معظم مناطق الشبكة العميقة الغير مبوبة تقع في قواعد البيانات اليومية البسيطة، مثل ليكسيز-نيكسيز[2] أو سجلات مكتب براءات الاختراع بالولايات المتحدة. لكن على غرار دمية ماتريوشكا الروسية، تحتوي الشبكة العميقة على عالم أشد عمقًا، مجتمع أصغر لكنه شديد الأهمية، حيث يجتمع الأشرار لتحقيق أغراض دنيئة. مرحبًا بك في الشبكة المظلمة، والتي تسمى أحيانًا دارك-نت Darknet، وهو قبو رقمي ضخم يجتمع فيه الهاكرز ورجال العصابات والإرهابيون والبيدوفايلز[3] ليمارسوا تجاراتهم. في السطور التالية سنعرض لك ما لا يزيد عن عينة سريعة من البضائع والخدمات التي يتم تداولها في أعمق كهوف الشبكة وأشدها ظلمة.
         * الأشياء التي يمكنك شراءها:
         * 1- المخدرات
         * كميات فردية أو تجارية من المخدرات القانونية و الغير قانونية من كل الأنواع متاحة للبيع في القبو الرقمي. متجر الطريق الحريري Silk Road الألكتروني، أكبر متجر للمخدرات والذي تم إغلاقه الآن، بلغ حجم أعماله 200 مليون دولار في خلال 28 شهرًا.
         * 2- العملة المقلدة
         * النقود المزورة تتباين فيما بينها كثيرًا من حيث الجودة والتكلفة، لكن اليورو، والجنيه الاسترليني، والين، كلهم متاحون للبيع. ستمائة دولار قد توفر لك شراء 2500 دولار من العملة الأميريكية المقلدة، مع وعد بقدرة العملة المقلدة على تخطي قلم الفحص والأشعة فوق البنفسجية.
         * 3- المستندات المزورة
         * جواز السفر، رخصة القيادة، أوراق الجنسية، إثباتات الشخصية المزورة، الشهادات الجامعية، أوراق الهجرة، بل وبطاقات إثبات الشخصية الديبلوماسية، كلها متاحة في السوق غير القانوني (مثل أونيون لخدمات الهوية). رخصة قيادة أميريكية تكلفك تقريبًا 200 دولارا أميريكيًا، بينما جواز السفر الأميريكي أو الإنجليزي سيكلفك بضعة آلاف من الدولارات.
         * 4- الأسلحة الشخصية، الذخيرة، المتفجرات
         * الأسلحة، مثل الطبنجة الشخصية، ومتفجرات C4 يمكن شراءها من الشبكة المظلمة. يشحن الباعة بضاعتهم في مغلفات خاصة لتجنب أشعة إكس، أو يبعثون بأجزاء السلاح مخبأة داخل ألعاب، أو آلات موسيقية أو أجهزة إلكترونية.
         * 5- القتلة المأجورون
         * مقدمي الخدمة – ومن بينهم شركة تسمى كولولهولو C’thulhu على اسم الوحش الذي ابتكره الكاتب ه. ب. لوفكرافت H.P. Lovecraft في رواياته – يقدمون دعاياتهم بعبارة “حلول دائمة لمشكلات شائعة”. هؤلاء القتلة المأجورون يقومون بكل شيء، بداية من الضغائن الشخصية حتى الاغتيالات السياسية، ويقبلون مقابل أعمالهم الدفع عن طريق البيتكوين (bitcoin) كأجرة، ويقدمون دليلا مصورًا على إتمام المهمة.
         * 6- الأعضاء البشرية
         * في الأركان الأشد ظلمة من الشبكة، تنتعش سوق سوداء ضخمة للأعضاء البشرية. الكلى قد تباع لقاء 200 ألف دولار، القلوب مقابل 120 ألف دولار، و الكبد مقابل 150 ألف دولار. زوج من الأعين يكلف 1500 دولارا.
         * الأشياء التي تجعل جرائم الانترنت ناجحة
         * 1- النقود المشفرة
         * النقود الرقمية (مثل بيتكوين ودارك-كوين)، ونظام دفع ليبرتي ريسيرف (Liberty Reserve) يقدمان نظامًا ملائمًا للمستخدمين لإنفاق الأموال أونلاين مع اخفاء هوياتهم الحقيقية.
         * 2- خدمة خالية من الثغرات لاستضافة المواقع
         * بعض مضيفي المواقع في روسيا وأوكرانيا يرحبون بأي محتوى، لا يحاولون بأي شكل معرفة هوية زبائنهم الحقيقية، و يقبلون الدفع مجهول الهوية بواسطة بيتكوين، و يتجاهلون باستمرار مذكرات الضبط والإحضار من السلطات.
         * 3- الحوسبة السحابية Cloud Computing:
         * عن طريق وضع برامجهم المؤذية Malware في ضيافة الشركات ذات السمعة النظيفة، لا يعاني الهاكرز من أي اعتراض لتداولاتهم من جانب الأنظمة الأمنية. أشارت دراسة حديثة أن 16% من البرمجيات المؤذية في العالم وقنوات توزع الهجمات الألكترونية بدأت من سحابة أمازون.
         * 4- برمجيات الجريمة
         * المجرمين الأقل مهارة بإمكانهم شراء كل الأدوات التي يحتاجونها للعثور على ثغرات النظام، و سرقة الهويات، و تهديد السيرفرات، و سرقة المعلومات. في عام 2013 لم يتطلب الأمر أكثر من هاكر يملك مجموعة أدوات مشابهة لغزو نظام نقاط بيع تارجت Target’s point-of-sale system .
         * 5- هاكرز للإيجار
         * نقابات الجريمة الألكترونية المنظمة تعرض الهاكرز للإيجار. مجموعة لينكس الصينية السرية تفخر بتوفر مايقرب من 100 لص ألكتروني محترف، بعضهم يعرف عنه أنه اخترق نظمًا لجوجل، و أدوبي، و لوكهيد مارتين.
         * 6- مراكز خدمة اتصالات الجرائم متعددة اللغات
         * هؤلاء الموظفون سيلعبون أي دور توده، مثل تقديم شهادات خبرة أو تدريب، بدء عملية نقل أموال، إعادة تشغيل حسابات مخترقة. المكالمة تكلفك مايقرب من 10 دولارات.
         * كيفية الوصول إلى برمجيات الشبكة المظلمة
         * – المتصفحات السرية
         * تور Tor وهو اختصار أونيون راوتر، هو واحد من البرامج العديدة التي تفتح بابًا للشبكة المظلمة. يقوم تور بتعديل اتجاه الإشارة عبر 6000 سيرفر ليخفي مصدر طلب الوصول لصفحة معينة، مما يجعل الضغطات على روابط ممنوعة لا يمكن اقتفاء أثرها من قبل السلطات. المتصفح يستخدم صفحات سرية متبوعة ب (.onion) بدلا من (.com) والي لا يمكن الوصول إليها إلا من خلال متصفح تور.
         * – محركات البحث السرية
         * في أواسط عام 2014، اخترع الهاكرز محرك بحث جرامز Grams، وهو محرك البحث الأول في الشبكة المظلمة الذي تم توزيعه بنطاق كبير. يتيح جرامز للمجرمين المستقبليين البحث عن المخدرات و السلاح و حسابات البنوك المسروقة عبر العديد من المواقع المخفية. الأدهى أنها تحتوي على زر “ضربة حظ” I’m Feeling Lucky و يحتوي على إعلانات استهدافية، حيث يقوم مروجو المخدرات بالتنافس على معدلات المرور.
         * – موسوعات الجريمة
         * موسوعات منظمة بعناية تحتوي على قوائم مبوبة بأنواع الجريمة، مثل الاختراق، الأسواق، الفيروسات، و المخدرات. يساعد الوصف المتاح لكل باب في تعريف القادمين الجدد بالموضوع و في توصيلهم بموادهم الإجرامية المفضلة.
         * – غرف الدردشة الخفية
         * مثل العالم الحقيقي تمامًا، كل مجرم يسعى للوصول إلى مواد إجرامية يجب أن يدخل من خلال توصية قبل أي تعامل معه. هناك شبكة من غرف الدردشة والمنتديات التي لا يمكن دخولها إلا من خلال دعوة، مخفاة خلف عناوين ويب غير مدرجة تتكون أسماؤها من حروف وأرقام، تتيح الدخول إلى أعتى الشبكات الإجرامية.
         * [1] ماريانا ترينش Mariana Trench هي أعمق نقطة في محيطات العالم، و تقع في غرب المحيط الهادي.
         * [2] ليكسيز-نيكسيز LexisNexis شركة نشر أميريكية تتيح قاعدة بيانات ضخمة للأبحاث القانونية و التجارية، تشمل النشرات والدراسات و التغطيات الإخبارية وغيرها.
         * [3] Pedophiles الأشخاص الذين ينجذبون جنسيًا إلى الأطفال
         * [4] Liberty Reserve شركة كانت تقدم خدمات الدفع الآمنة عبر الانترنت بواسطة العملات الرقمية، تم إغلاقها بواسطة حكومة الولايات المتحدة الأميريكية في 2013 بسبب استخدام خدماتها في أنشطة إجرامية لا يمكن تتبعها.
         * post_author : 1
         * post_excerpt :
         * post_date : December 20, 2016
         * post_date_gmt : December 20, 2016
         * comment_status : open
         * ping_status : open
         * post_name : %d8%a7%d9%84%d9%88%d9%8a%d8%a8-%d8%a7%d9%84%d8%ae%d9%81%d9%8a-%d8%a7%d9%84%d8%af%d9%8a%d8%a8-%d9%88%d9%8a%d8%a8
         * post_modified : December 20, 2016
         * post_modified_gmt : December 20, 2016
         * post_content_filtered :
         * post_parent : 0
         * menu_order : 0
         * comment_count : 0
         * featuredimage :
         * featuredthumb :
         * taxonomies : []
         * category : [{"id":"1","name":"Uncategorized","slug":"uncategorized","description":"","count":"11","parent":"0","image":"Plugin Categories Images must be enabled","custom_fields":"ACF plugin needs to be enabled, Back to documentation for further information"}]
         * tags : []
         * author : [{"ID":"1","user_login":"sabri","user_nicename":"sabri","user_email":"sabri.sniperdw@gmail.com","user_url":"","user_registered":"December 20, 2016","display_name":"sabri","role":{"administrator":true},"first_name":"","last_name":"","nickname":"sabri","description":"","avatar":"http://2.gravatar.com/avatar/2565f560c372c957c8a3a3426447b0bb?s=96&#038;d=mm&#038;r=g","aim":"","jabber":"","yim":"","custom_fields":"ACF plugin needs to be enabled, Back to documentation for further information"}]
         * post_format : false
         * custom_fields : ACF plugin needs to be enabled, Back to documentation for further information
         */

        @SerializedName("ID")
        private String ID;
        @SerializedName("post_title")
        private String postTitle;
        @SerializedName("guid")
        private String guid;
        @SerializedName("post_content")
        private String postContent;
        @SerializedName("post_author")
        private String postAuthor;
        @SerializedName("post_excerpt")
        private String postExcerpt;
        @SerializedName("post_date")
        private String postDate;
        @SerializedName("post_date_gmt")
        private String postDateGmt;
        @SerializedName("comment_status")
        private String commentStatus;
        @SerializedName("ping_status")
        private String pingStatus;
        @SerializedName("post_name")
        private String postName;
        @SerializedName("post_modified")
        private String postModified;
        @SerializedName("post_modified_gmt")
        private String postModifiedGmt;
        @SerializedName("post_content_filtered")
        private String postContentFiltered;
        @SerializedName("post_parent")
        private String postParent;
        @SerializedName("menu_order")
        private String menuOrder;
        @SerializedName("comment_count")
        private String commentCount;
        @SerializedName("featuredimage")
        private String featuredimage;
        @SerializedName("featuredthumb")
        private String featuredthumb;
        @SerializedName("post_format")
        private boolean postFormat;
        @SerializedName("custom_fields")
        private String customFields;
        @SerializedName("taxonomies")
        private List<?> taxonomies;
        @SerializedName("category")
        private List<Category> category;
        @SerializedName("tags")
        private List<?> tags;
        @SerializedName("author")
        private List<Author> author;

        public String getID() {
            return ID;
        }

        public void setID(String ID) {
            this.ID = ID;
        }

        public String getPostTitle() {
            return postTitle;
        }

        public void setPostTitle(String postTitle) {
            this.postTitle = postTitle;
        }

        public String getGuid() {
            return guid;
        }

        public void setGuid(String guid) {
            this.guid = guid;
        }

        public String getPostContent() {
            return postContent;
        }

        public void setPostContent(String postContent) {
            this.postContent = postContent;
        }

        public String getPostAuthor() {
            return postAuthor;
        }

        public void setPostAuthor(String postAuthor) {
            this.postAuthor = postAuthor;
        }

        public String getPostExcerpt() {
            return postExcerpt;
        }

        public void setPostExcerpt(String postExcerpt) {
            this.postExcerpt = postExcerpt;
        }

        public String getPostDate() {
            return postDate;
        }

        public void setPostDate(String postDate) {
            this.postDate = postDate;
        }

        public String getPostDateGmt() {
            return postDateGmt;
        }

        public void setPostDateGmt(String postDateGmt) {
            this.postDateGmt = postDateGmt;
        }

        public String getCommentStatus() {
            return commentStatus;
        }

        public void setCommentStatus(String commentStatus) {
            this.commentStatus = commentStatus;
        }

        public String getPingStatus() {
            return pingStatus;
        }

        public void setPingStatus(String pingStatus) {
            this.pingStatus = pingStatus;
        }

        public String getPostName() {
            return postName;
        }

        public void setPostName(String postName) {
            this.postName = postName;
        }

        public String getPostModified() {
            return postModified;
        }

        public void setPostModified(String postModified) {
            this.postModified = postModified;
        }

        public String getPostModifiedGmt() {
            return postModifiedGmt;
        }

        public void setPostModifiedGmt(String postModifiedGmt) {
            this.postModifiedGmt = postModifiedGmt;
        }

        public String getPostContentFiltered() {
            return postContentFiltered;
        }

        public void setPostContentFiltered(String postContentFiltered) {
            this.postContentFiltered = postContentFiltered;
        }

        public String getPostParent() {
            return postParent;
        }

        public void setPostParent(String postParent) {
            this.postParent = postParent;
        }

        public String getMenuOrder() {
            return menuOrder;
        }

        public void setMenuOrder(String menuOrder) {
            this.menuOrder = menuOrder;
        }

        public String getCommentCount() {
            return commentCount;
        }

        public void setCommentCount(String commentCount) {
            this.commentCount = commentCount;
        }

        public String getFeaturedimage() {
            return featuredimage;
        }

        public void setFeaturedimage(String featuredimage) {
            this.featuredimage = featuredimage;
        }

        public String getFeaturedthumb() {
            return featuredthumb;
        }

        public void setFeaturedthumb(String featuredthumb) {
            this.featuredthumb = featuredthumb;
        }

        public boolean isPostFormat() {
            return postFormat;
        }

        public void setPostFormat(boolean postFormat) {
            this.postFormat = postFormat;
        }

        public String getCustomFields() {
            return customFields;
        }

        public void setCustomFields(String customFields) {
            this.customFields = customFields;
        }

        public List<?> getTaxonomies() {
            return taxonomies;
        }

        public void setTaxonomies(List<?> taxonomies) {
            this.taxonomies = taxonomies;
        }

        public List<Category> getCategory() {
            return category;
        }

        public void setCategory(List<Category> category) {
            this.category = category;
        }

        public List<?> getTags() {
            return tags;
        }

        public void setTags(List<?> tags) {
            this.tags = tags;
        }

        public List<Author> getAuthor() {
            return author;
        }

        public void setAuthor(List<Author> author) {
            this.author = author;
        }

        public static class Category {
            /**
             * id : 1
             * name : Uncategorized
             * slug : uncategorized
             * description :
             * count : 11
             * parent : 0
             * image : Plugin Categories Images must be enabled
             * custom_fields : ACF plugin needs to be enabled, Back to documentation for further information
             */

            @SerializedName("id")
            private String id;
            @SerializedName("name")
            private String name;
            @SerializedName("slug")
            private String slug;
            @SerializedName("description")
            private String description;
            @SerializedName("count")
            private String count;
            @SerializedName("parent")
            private String parent;
            @SerializedName("image")
            private String image;
            @SerializedName("custom_fields")
            private String customFields;

            public String getId() {
                return id;
            }

            public void setId(String id) {
                this.id = id;
            }

            public String getName() {
                return name;
            }

            public void setName(String name) {
                this.name = name;
            }

            public String getSlug() {
                return slug;
            }

            public void setSlug(String slug) {
                this.slug = slug;
            }

            public String getDescription() {
                return description;
            }

            public void setDescription(String description) {
                this.description = description;
            }

            public String getCount() {
                return count;
            }

            public void setCount(String count) {
                this.count = count;
            }

            public String getParent() {
                return parent;
            }

            public void setParent(String parent) {
                this.parent = parent;
            }

            public String getImage() {
                return image;
            }

            public void setImage(String image) {
                this.image = image;
            }

            public String getCustomFields() {
                return customFields;
            }

            public void setCustomFields(String customFields) {
                this.customFields = customFields;
            }
        }

        public static class Author {
            /**
             * ID : 1
             * user_login : sabri
             * user_nicename : sabri
             * user_email : sabri.sniperdw@gmail.com
             * user_url :
             * user_registered : December 20, 2016
             * display_name : sabri
             * role : {"administrator":true}
             * first_name :
             * last_name :
             * nickname : sabri
             * description :
             * avatar : http://2.gravatar.com/avatar/2565f560c372c957c8a3a3426447b0bb?s=96&#038;d=mm&#038;r=g
             * aim :
             * jabber :
             * yim :
             * custom_fields : ACF plugin needs to be enabled, Back to documentation for further information
             */

            @SerializedName("ID")
            private String ID;
            @SerializedName("user_login")
            private String userLogin;
            @SerializedName("user_nicename")
            private String userNicename;
            @SerializedName("user_email")
            private String userEmail;
            @SerializedName("user_url")
            private String userUrl;
            @SerializedName("user_registered")
            private String userRegistered;
            @SerializedName("display_name")
            private String displayName;
            @SerializedName("role")
            private Role role;
            @SerializedName("first_name")
            private String firstName;
            @SerializedName("last_name")
            private String lastName;
            @SerializedName("nickname")
            private String nickname;
            @SerializedName("description")
            private String description;
            @SerializedName("avatar")
            private String avatar;
            @SerializedName("aim")
            private String aim;
            @SerializedName("jabber")
            private String jabber;
            @SerializedName("yim")
            private String yim;
            @SerializedName("custom_fields")
            private String customFields;

            public String getID() {
                return ID;
            }

            public void setID(String ID) {
                this.ID = ID;
            }

            public String getUserLogin() {
                return userLogin;
            }

            public void setUserLogin(String userLogin) {
                this.userLogin = userLogin;
            }

            public String getUserNicename() {
                return userNicename;
            }

            public void setUserNicename(String userNicename) {
                this.userNicename = userNicename;
            }

            public String getUserEmail() {
                return userEmail;
            }

            public void setUserEmail(String userEmail) {
                this.userEmail = userEmail;
            }

            public String getUserUrl() {
                return userUrl;
            }

            public void setUserUrl(String userUrl) {
                this.userUrl = userUrl;
            }

            public String getUserRegistered() {
                return userRegistered;
            }

            public void setUserRegistered(String userRegistered) {
                this.userRegistered = userRegistered;
            }

            public String getDisplayName() {
                return displayName;
            }

            public void setDisplayName(String displayName) {
                this.displayName = displayName;
            }

            public Role getRole() {
                return role;
            }

            public void setRole(Role role) {
                this.role = role;
            }

            public String getFirstName() {
                return firstName;
            }

            public void setFirstName(String firstName) {
                this.firstName = firstName;
            }

            public String getLastName() {
                return lastName;
            }

            public void setLastName(String lastName) {
                this.lastName = lastName;
            }

            public String getNickname() {
                return nickname;
            }

            public void setNickname(String nickname) {
                this.nickname = nickname;
            }

            public String getDescription() {
                return description;
            }

            public void setDescription(String description) {
                this.description = description;
            }

            public String getAvatar() {
                return avatar;
            }

            public void setAvatar(String avatar) {
                this.avatar = avatar;
            }

            public String getAim() {
                return aim;
            }

            public void setAim(String aim) {
                this.aim = aim;
            }

            public String getJabber() {
                return jabber;
            }

            public void setJabber(String jabber) {
                this.jabber = jabber;
            }

            public String getYim() {
                return yim;
            }

            public void setYim(String yim) {
                this.yim = yim;
            }

            public String getCustomFields() {
                return customFields;
            }

            public void setCustomFields(String customFields) {
                this.customFields = customFields;
            }

            public static class Role {
                /**
                 * administrator : true
                 */

                @SerializedName("administrator")
                private boolean administrator;

                public boolean isAdministrator() {
                    return administrator;
                }

                public void setAdministrator(boolean administrator) {
                    this.administrator = administrator;
                }
            }
        }
    }
}
